asuFlumeCleanCases/3dAsuFlume_singleParticle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          160;
        startFace       145000;
    }
    top
    {
        type            patch;
        nFaces          2000;
        startFace       145160;
    }
    groundAndWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          7840;
        startFace       147160;
    }
)

// ************************************************************************* //
